tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
    const char* heroTone = "";
    const char* heroEyebrow = "当前状态";
    const char* heroTitle = "一切正常，当前没有浇水";
    const char* heroDescription = "自动计划会按设定时间运行，也可以随时手动开始。";
    const char* heroHref = "/irrigation/run";
    const char* heroAction = "开始浇水";
    if (g_app->unexpectedFlowAlarm()) {
        heroTone = " danger";
        heroTitle = "检测到非计划水流";
        heroDescription = "所有水路关闭时仍检测到水流，请检查阀门和管路是否漏水。";
        heroHref = "/irrigation/zones";
        heroAction = "查看水路设置";
    } else if (watering.active) {
        heroTone = " info";
        const char* zoneName = nullptr;
        if (config && watering.activeZoneId >= 1 && watering.activeZoneId <= config->zones.size()) {
            zoneName = config->zones[watering.activeZoneId - 1U].name.data();
        }
        if (zoneName) {
            std::snprintf(value, sizeof(value), "正在浇水：%s", zoneName);
            heroTitle = value;
        } else {
            heroTitle = "正在浇水";
        }
        formatElapsed(watering.elapsedSec, secondary, sizeof(secondary));
        heroDescription = secondary;
        heroHref = "/irrigation/run";
        heroAction = "查看浇水";
    } else if (g_app->schedulerStorageFault()) {
        heroTone = " danger";
        heroTitle = "自动浇水暂不可用";
        heroDescription = "调度状态无法可靠保存；手动浇水仍可使用。";
        heroHref = "/esp32base";
        heroAction = "查看系统状态";
    } else if (schedulerTime == WateringScheduler::TimeState::RtcRollback) {
        heroTone = " warn";
        heroTitle = "设备时间异常，自动浇水已停止";
        heroDescription = "检测到 RTC 时间明显倒退，等待 NTP 校时后自动恢复判断。";
        heroHref = "/esp32base";
        heroAction = "查看时间状态";
    } else if (!timeTrusted) {
        heroTone = " warn";
        heroTitle = "设备时间尚未就绪";
        heroDescription = "自动计划暂时不会运行，手动浇水仍可使用。";
        heroHref = "/esp32base";
        heroAction = "查看时间状态";
    } else if (storageFault) {
        heroTone = " warn";
        heroTitle = "设备可以浇水，但部分数据存储异常";
        heroDescription = "请查看系统状态；自动计划或历史记录可能受到影响。";
        heroHref = "/esp32base";
        heroAction = "查看系统状态";
    }
    Esp32BaseWeb::sendChunk("<section class='home-hero");
    Esp32BaseWeb::sendChunk(heroTone);
    Esp32BaseWeb::sendChunk("'><div><span class='home-eyebrow'>");
    Esp32BaseWeb::writeHtmlEscaped(heroEyebrow);
    Esp32BaseWeb::sendChunk("</span><h1>");
    Esp32BaseWeb::writeHtmlEscaped(heroTitle);
    Esp32BaseWeb::sendChunk("</h1><p>");
    Esp32BaseWeb::writeHtmlEscaped(heroDescription);
    if (watering.active) {
        Esp32BaseWeb::sendChunk(" · ");
        Esp32BaseWeb::writeHtmlEscaped(wateringStateName(watering.state));
        Esp32BaseWeb::sendChunk(watering.flowEstablished ? " · 水流正常" : " · 正在等待水流");
    }
    Esp32BaseWeb::sendChunk("</p></div><a class='btnlink info' href='");
    Esp32BaseWeb::writeHtmlEscaped(heroHref);
    Esp32BaseWeb::sendChunk("'>");
    Esp32BaseWeb::writeHtmlEscaped(heroAction);
    Esp32BaseWeb::sendChunk("</a></section>");
    const bool heroShowsOtherPriority = watering.active || g_app->unexpectedFlowAlarm();
    if (heroShowsOtherPriority && g_app->schedulerStorageFault()) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "自动浇水暂不可用",
                                 "调度状态无法可靠保存；当前或手动浇水不受影响。");
    } else if (heroShowsOtherPriority && schedulerTime == WateringScheduler::TimeState::RtcRollback) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "设备时间异常",
                                 "自动计划已停止，等待 NTP 校时后恢复判断。");
    } else if (heroShowsOtherPriority && !timeTrusted) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "设备时间尚未就绪",
                                 "自动计划暂时不会运行，手动浇水仍可使用。");
    }
    if (heroShowsOtherPriority && storageFault && !g_app->schedulerStorageFault()) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "部分数据存储异常",
                                 "请在当前浇水结束后查看系统状态。");
    }
    Esp32BaseWeb::sendChunk("<div class='home-grid'>");

    Esp32BaseWeb::sendChunk("<section class='home-card'><div class='home-card-head'><h2>下一次自动浇水</h2>");
    if (automatic.mode == AutomaticWateringMode::Enabled) {
        Esp32BaseWeb::sendChunk("<span class='tag ok'>自动浇水正常</span></div>");
    } else {
        Esp32BaseWeb::sendChunk("<span class='tag warn'>自动浇水已暂停</span></div>");
    }
    if (automatic.mode == AutomaticWateringMode::PausedIndefinitely) {
        Esp32BaseWeb::sendChunk("<div class='home-main'>等待你手动恢复</div><p class='home-sub'>暂停期间到点的计划不会执行，也不会补执行。</p>");
    } else {
        if (automatic.mode == AutomaticWateringMode::PausedUntil) {
            if (formatFriendlyDateTime(automatic.resumeAtEpoch, now.epochSec, value, sizeof(value)) &&
                formatFullDateTime(automatic.resumeAtEpoch, secondary, sizeof(secondary))) {
                Esp32BaseWeb::sendChunk("<div class='home-main'>将在");
                Esp32BaseWeb::writeHtmlEscaped(value);
                Esp32BaseWeb::sendChunk("自动恢复</div><p class='home-sub'>");
                Esp32BaseWeb::writeHtmlEscaped(secondary);
                if (!timeTrusted) Esp32BaseWeb::sendChunk("；设备时间恢复可信后才会判断是否到期");
                Esp32BaseWeb::sendChunk("</p>");
            }
        }
        if (next.status == NextAutomaticWateringStatus::Available &&
            formatFriendlyDateTime(next.scheduledEpoch, now.epochSec, value, sizeof(value)) &&
            formatFullDateTime(next.scheduledEpoch, secondary, sizeof(secondary))) {
            if (automatic.mode == AutomaticWateringMode::Enabled) {
                Esp32BaseWeb::sendChunk("<div class='home-main'>");
                Esp32BaseWeb::writeHtmlEscaped(value);
                Esp32BaseWeb::sendChunk("</div><p class='home-sub'>");
                Esp32BaseWeb::writeHtmlEscaped(secondary);
                Esp32BaseWeb::sendChunk("</p>");
            }
            Esp32BaseWeb::sendChunk("<div class='home-facts'><div class='home-fact'><span>");
            Esp32BaseWeb::sendChunk(automatic.mode == AutomaticWateringMode::Enabled ? "执行计划" : "恢复后的计划");
            Esp32BaseWeb::sendChunk("</span><b>");
            const char* nextPlanName = planNameById(config, next.planId);
            if (nextPlanName) {
                Esp32BaseWeb::writeHtmlEscaped(nextPlanName);
            } else {
                Esp32BaseWeb::sendChunk("计划 ");
                sendUnsigned(next.planId);
            }
            Esp32BaseWeb::sendChunk("</b></div>");
            if (automatic.mode == AutomaticWateringMode::PausedUntil) {
                Esp32BaseWeb::sendChunk("<div class='home-fact'><span>下一次执行</span><b>");
                Esp32BaseWeb::writeHtmlEscaped(value);
                Esp32BaseWeb::sendChunk("</b></div>");
            }
            Esp32BaseWeb::sendChunk("</div>");
        } else if (next.status == NextAutomaticWateringStatus::NoEnabledPlans) {
            Esp32BaseWeb::sendChunk("<div class='home-empty'>还没有开启自动执行的计划。设置计划和启动时间后，下一次浇水会显示在这里。</div>");
        } else if (next.status == NextAutomaticWateringStatus::RtcRollback) {
            Esp32BaseWeb::sendChunk("<div class='home-empty'>设备时间发生倒退，暂时无法计算下一次浇水。</div>");
        } else if (next.status == NextAutomaticWateringStatus::TimeUnavailable) {
            Esp32BaseWeb::sendChunk("<div class='home-empty'>设备时间尚未就绪，暂时无法计算下一次浇水。</div>");
        }
    }
    Esp32BaseWeb::sendChunk("<div class='home-card-actions'>");
    if (automatic.mode == AutomaticWateringMode::Enabled) {
        Esp32BaseWeb::sendChunk("<button type='button' class='btnlink info' onclick=\"document.getElementById('pause-auto').showModal()\">暂停自动浇水</button>");
    } else {
        Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation' onsubmit='return once(this)'><input type='hidden' name='action' value='resume'><input type='submit' class='btnlink ok' value='提前恢复'></form>");
    }
    if (next.status == NextAutomaticWateringStatus::NoEnabledPlans) {
        Esp32BaseWeb::sendChunk("<a class='btnlink secondary' href='/irrigation/plans'>设置计划</a>");
    }
    Esp32BaseWeb::sendChunk("</div></section>");

    Esp32BaseWeb::sendChunk("<section class='home-card'><div class='home-card-head'><h2>最近一次浇水</h2><a class='btnlink compact secondary' href='/irrigation/records'>全部记录</a></div>");
    if (g_app->recordStorageFault()) {
        Esp32BaseWeb::sendChunk("<div class='home-empty'>浇水记录存储异常，暂时无法读取最近记录。</div>");
    } else if (!latest.found) {
        Esp32BaseWeb::sendChunk("<div class='home-empty'>还没有浇水记录。完成第一次实际出水后，这里会显示结果。</div><div class='home-card-actions'><a class='btnlink info' href='/irrigation/run'>开始浇水</a></div>");
    } else {
        uint32_t completedEpoch = 0;
        const bool hasCompletedTime = Esp32BaseRecordStore::resolveCompletedEpoch(
            latest.record.timing, completedEpoch);
        const WateringRecordTotals totals = WateringRecordCodec::calculateTotals(
            latest.record.payload);
        Esp32BaseWeb::sendChunk("<div class='home-main'>");
        if (hasCompletedTime && formatFriendlyDateTime(completedEpoch, now.epochSec, value, sizeof(value))) {
            Esp32BaseWeb::writeHtmlEscaped(value);
        } else {
            Esp32BaseWeb::sendChunk("最近完成的一次浇水");
        }
        Esp32BaseWeb::sendChunk("</div><p class='home-sub'>");
        Esp32BaseWeb::writeHtmlEscaped(resultName(latest.record.payload.result));
        Esp32BaseWeb::sendChunk(" · ");
        Esp32BaseWeb::writeHtmlEscaped(sourceName(latest.record.payload.source));
        const char* recordPlanName = planNameById(config, latest.record.payload.planId);
        if (recordPlanName) {
            Esp32BaseWeb::sendChunk(" · ");
            Esp32BaseWeb::writeHtmlEscaped(recordPlanName);
        }
        Esp32BaseWeb::sendChunk("</p><div class='home-facts'><div class='home-fact'><span>实际浇水</span><b>");
        formatElapsed(totals.actualWateringSec, value, sizeof(value));
        Esp32BaseWeb::writeHtmlEscaped(value);
        Esp32BaseWeb::sendChunk("</b></div><div class='home-fact'><span>估算用水</span><b>");
        if (totals.estimatedWaterMl >= 1000ULL) {
            std::snprintf(value, sizeof(value), "%llu.%01llu L",
                          static_cast<unsigned long long>(totals.estimatedWaterMl / 1000ULL),
                          static_cast<unsigned long long>((totals.estimatedWaterMl % 1000ULL) / 100ULL));
        } else {
            std::snprintf(value, sizeof(value), "%llu mL",
                          static_cast<unsigned long long>(totals.estimatedWaterMl));
        }
        Esp32BaseWeb::writeHtmlEscaped(value);
        Esp32BaseWeb::sendChunk("</b></div></div><div class='home-card-actions'><a class='btnlink secondary' href='/irrigation/records?id=");
        sendUnsigned(latest.record.recordId);
        Esp32BaseWeb::sendChunk("'>查看详情</a></div>");
    }
    Esp32BaseWeb::sendChunk("</section></div>");

