tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
    const uint32_t checkpointEpoch = g_app->lastKnownAliveEpoch();
    const char* resetReason = Esp32BaseSystem::resetReason();
    if (now.synced && checkpointEpoch != 0 && now.bootStartEpochSec >= checkpointEpoch &&
        (std::strcmp(resetReason, "poweron") == 0 ||
         std::strcmp(resetReason, "brownout") == 0)) {
        char checkpointText[24]{};
        char bootText[24]{};
        char message[96]{};
        if (Esp32BaseTime::formatEpoch(checkpointEpoch, checkpointText,
                                       sizeof(checkpointText), "%Y-%m-%d %H:%M") &&
            Esp32BaseTime::formatEpoch(now.bootStartEpochSec, bootText,
                                       sizeof(bootText), "%Y-%m-%d %H:%M")) {
            std::snprintf(message, sizeof(message), "%s 至 %s；仅为可能范围，不是精确停电时间",
                          checkpointText, bootText);
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "可能断电范围", message);
        }
    }
    const uint32_t initialResumeEpoch = timeTrusted && now.epochSec <= UINT32_MAX - 86400U
                                            ? now.epochSec + 86400U
                                            : 1767196800UL;
    char inputDateTime[20]{};
    char minimumDateTime[20]{};
    formatInputDateTime(initialResumeEpoch, inputDateTime, sizeof(inputDateTime));
    formatInputDateTime(timeTrusted && now.epochSec <= UINT32_MAX - 60U ? now.epochSec + 60U
                                                                       : 1767196800UL,
                        minimumDateTime, sizeof(minimumDateTime));
    Esp32BaseWeb::sendChunk("<dialog id='pause-auto' class='panel eb-modal pause-modal' data-eb-light-dismiss='1'><h2>暂停自动浇水</h2><p class='muted'>暂停只影响之后的自动计划，不停止当前浇水，也不影响手动浇水。</p><form id='pause-form' method='post' action='/irrigation' data-now-epoch='");
    sendUnsigned(now.epochSec);
    Esp32BaseWeb::sendChunk("' data-time-trusted='");
    Esp32BaseWeb::sendChunk(timeTrusted ? "1" : "0");
    Esp32BaseWeb::sendChunk("'><input id='pause-action' type='hidden' name='action' value='pause_hours'><div class='pause-preview' aria-live='polite'><b id='pause-preview-title'>将暂停 24 小时</b><span id='pause-preview-detail'>正在计算恢复时间…</span></div>");
    if (!timeTrusted) {
        Esp32BaseWeb::sendChunk("<div class='notice'><b>设备时间尚未就绪</b><br>暂时只能选择暂停至手动恢复。</div>");
    }
    Esp32BaseWeb::sendChunk("<div class='pause-modes' role='group' aria-label='暂停方式'><button type='button' class='pause-mode secondary selected' data-pause-mode='duration'");
    if (!timeTrusted) Esp32BaseWeb::sendChunk(" disabled");
    Esp32BaseWeb::sendChunk(">按时长</button><button type='button' class='pause-mode secondary' data-pause-mode='until'");
    if (!timeTrusted) Esp32BaseWeb::sendChunk(" disabled");
    Esp32BaseWeb::sendChunk(">到指定时间</button><button type='button' class='pause-mode secondary' data-pause-mode='manual'>手动恢复</button></div><div id='pause-duration' class='pause-pane'><label for='pause-hours'>暂停多少小时</label><div class='pause-stepper'><button type='button' class='secondary' id='pause-minus' aria-label='减少一小时'>−</button><input id='pause-hours' type='number' name='hours' min='1' max='8760' value='24' inputmode='numeric'><button type='button' class='secondary' id='pause-plus' aria-label='增加一小时'>+</button></div><div class='pause-quick' aria-label='常用暂停时长'>");
    const uint16_t quickHours[] = {1, 6, 12, 24, 48};
    for (const uint16_t hours : quickHours) {
        Esp32BaseWeb::sendChunk("<button type='button' data-hours='");
        sendUnsigned(hours);
        Esp32BaseWeb::sendChunk("'");
        if (hours == 24U) Esp32BaseWeb::sendChunk(" class='selected'");
        Esp32BaseWeb::sendChunk(">+");
        sendUnsigned(hours);
        Esp32BaseWeb::sendChunk(" 小时</button>");
    }
    Esp32BaseWeb::sendChunk("</div><small class='pause-help'>可输入 1～8760 个整小时，使用 − / + 每次调整 1 小时。</small></div><div id='pause-until' class='pause-pane' hidden><label>常用恢复时间</label><div class='pause-quick'><button type='button' data-day='1' data-hour='6'>明早 6 点</button><button type='button' data-day='1' data-hour='8'>明早 8 点</button><button type='button' data-day='1' data-hour='20'>明晚 8 点</button><button type='button' data-day='2' data-hour='6'>后天早 6 点</button></div><label for='pause-resume-at'>自定义时间（UTC+8）</label><input id='pause-resume-at' type='datetime-local' name='resume_at' min='");
    Esp32BaseWeb::writeHtmlEscaped(minimumDateTime);
    Esp32BaseWeb::sendChunk("' max='2099-12-31T23:59' value='");
    Esp32BaseWeb::writeHtmlEscaped(inputDateTime);
    Esp32BaseWeb::sendChunk("'><small class='pause-help'>选择一个明确的恢复日期和时间。</small></div><div id='pause-manual' class='pause-pane' hidden><b>暂停至手动恢复</b><p class='muted'>自动计划会一直保持暂停，直到你回到首页点击“提前恢复”。</p></div><div class='actions'><button type='button' class='secondary' onclick='this.closest(\"dialog\").close()'>取消</button><input type='submit' value='确认暂停'></div></form></dialog>");
    Esp32BaseWeb::sendChunk(R"HTML(<script>(function(){
var form=document.getElementById('pause-form');if(!form)return;
var action=document.getElementById('pause-action'),hours=document.getElementById('pause-hours'),resume=document.getElementById('pause-resume-at');
var title=document.getElementById('pause-preview-title'),detail=document.getElementById('pause-preview-detail');
var panes={duration:document.getElementById('pause-duration'),until:document.getElementById('pause-until'),manual:document.getElementById('pause-manual')};
var mode='duration',serverNow=Number(form.dataset.nowEpoch||0),loadedAt=Date.now(),trusted=form.dataset.timeTrusted==='1',offset=28800;
function nowEpoch(){return serverNow+Math.floor((Date.now()-loadedAt)/1000)}
function pad(v){return String(v).padStart(2,'0')}
function localDate(epoch){return new Date((epoch+offset)*1000)}
function inputFromEpoch(epoch){var d=localDate(epoch);return d.getUTCFullYear()+'-'+pad(d.getUTCMonth()+1)+'-'+pad(d.getUTCDate())+'T'+pad(d.getUTCHours())+':'+pad(d.getUTCMinutes())}
function epochFromInput(value){if(!/^\d{4}-\d{2}-\d{2}T\d{2}:\d{2}$/.test(value))return 0;var p=value.match(/\d+/g).map(Number);return Math.floor(Date.UTC(p[0],p[1]-1,p[2],p[3],p[4])/1000)-offset}
function targetLabel(epoch){var d=localDate(epoch),n=nowEpoch(),day=Math.floor((epoch+offset)/86400),today=Math.floor((n+offset)/86400),prefix=day===today?'今天':day===today+1?'明天':day===today+2?'后天':(d.getUTCMonth()+1)+'月'+d.getUTCDate()+'日';return prefix+' '+pad(d.getUTCHours())+':'+pad(d.getUTCMinutes())}
function fullLabel(epoch){var d=localDate(epoch),week=['周日','周一','周二','周三','周四','周五','周六'],left=Math.max(0,epoch-nowEpoch()),relative=left<3600?Math.ceil(left/60)+' 分钟后':left<86400?Math.ceil(left/3600)+' 小时后':Math.ceil(left/86400)+' 天后';return d.getUTCFullYear()+'年'+(d.getUTCMonth()+1)+'月'+d.getUTCDate()+'日 '+week[d.getUTCDay()]+' '+pad(d.getUTCHours())+':'+pad(d.getUTCMinutes())+'（约 '+relative+'）'}
function clampHours(){var v=Math.round(Number(hours.value)||1);v=Math.max(1,Math.min(8760,v));hours.value=v;return v}
function update(){if(!trusted&&mode!=='manual')mode='manual';document.querySelectorAll('[data-pause-mode]').forEach(function(b){b.classList.toggle('selected',b.dataset.pauseMode===mode);b.setAttribute('aria-pressed',b.dataset.pauseMode===mode?'true':'false')});Object.keys(panes).forEach(function(k){panes[k].hidden=k!==mode});if(mode==='manual'){action.value='pause_indefinitely';title.textContent='暂停至手动恢复';detail.textContent='自动计划保持暂停，手动浇水仍可使用。';return}var epoch;if(mode==='duration'){var h=clampHours();action.value='pause_hours';epoch=nowEpoch()+h*3600;title.textContent='将暂停 '+h+' 小时'}else{action.value='pause_until';epoch=epochFromInput(resume.value);title.textContent=epoch?'将暂停到'+targetLabel(epoch):'请选择恢复时间'}detail.textContent=epoch?fullLabel(epoch):'恢复时间必须晚于现在。'}
function setMode(next){mode=next;update()}
document.querySelectorAll('[data-pause-mode]').forEach(function(b){b.addEventListener('click',function(){if(!b.disabled)setMode(b.dataset.pauseMode)})});
document.getElementById('pause-minus').addEventListener('click',function(){hours.value=clampHours()-1;update()});
document.getElementById('pause-plus').addEventListener('click',function(){hours.value=clampHours()+1;update()});hours.addEventListener('input',update);hours.addEventListener('change',update);
document.querySelectorAll('[data-hours]').forEach(function(b){b.addEventListener('click',function(){hours.value=b.dataset.hours;document.querySelectorAll('[data-hours]').forEach(function(x){x.classList.toggle('selected',x===b)});update()})});
document.querySelectorAll('[data-day][data-hour]').forEach(function(b){b.addEventListener('click',function(){var d=localDate(nowEpoch());d.setUTCDate(d.getUTCDate()+Number(b.dataset.day));d.setUTCHours(Number(b.dataset.hour),0,0,0);resume.value=inputFromEpoch(Math.floor(d.getTime()/1000)-offset);document.querySelectorAll('[data-day][data-hour]').forEach(function(x){x.classList.toggle('selected',x===b)});update()})});
resume.addEventListener('input',function(){document.querySelectorAll('[data-day][data-hour]').forEach(function(x){x.classList.remove('selected')});update()});
form.addEventListener('submit',function(e){if(mode==='until'&&epochFromInput(resume.value)<=nowEpoch()){e.preventDefault();alert('恢复时间必须晚于现在。');return}if(mode==='duration')clampHours();if(typeof once==='function'&&!once(form))e.preventDefault()});
if(!trusted)mode='manual';update();
})();</script>)HTML");
    endPage();
}

