tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
void IrrigationWeb::run() {
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        if (!Esp32BaseWeb::checkPostAllowed("irrigation_run")) return;
        bool success = false;
        if (actionIs("stop")) {
            success = g_app->stopWatering();
        } else if (actionIs("start_plan")) {
            uint32_t planId = 0;
            success = uintParam("plan_id", 1, kWateringPlanCount, planId) &&
                      g_app->startWateringPlan(static_cast<uint8_t>(planId)) ==
                          WateringStartResult::Started;
        } else if (actionIs("start_zones")) {
            std::array<uint16_t, BoardPins::kZoneCount> durations{};
            success = true;
            for (uint8_t index = 0; index < durations.size(); ++index) {
                char name[8];
                std::snprintf(name, sizeof(name), "zone%u", index + 1U);
                uint32_t duration = 0;
                if (Esp32BaseWeb::hasParam(name) && !uintParam(name, 0, 120, duration)) {
                    success = false;
                    break;
                }
                durations[index] = static_cast<uint16_t>(duration);
            }
            success = success && g_app->startManualWatering(durations) ==
                                     WateringStartResult::Started;
        }
        redirectResult("/irrigation/run", success);
        return;
    }
    if (!beginPage("浇水", "查看实时运行进度，或选择计划和自定义水路开始浇水")) return;
    Esp32BaseWeb::sendChunk(R"HTML(<style>
.run-idle-hero{display:flex;align-items:center;justify-content:space-between;gap:16px;padding:16px;border:1px solid #cfe1e5;border-radius:10px;background:linear-gradient(135deg,#f4faf7,#fff)}.run-idle-hero h3{margin:0 0 4px;font-size:19px}.run-idle-hero p{margin:0;color:var(--eb-muted)}
.run-live-head{display:flex;align-items:flex-start;justify-content:space-between;gap:18px;padding:17px;border:1px solid #cbdde5;border-radius:11px;background:linear-gradient(135deg,var(--eb-info-soft),#fff)}.run-live-head span{display:block;color:var(--eb-muted);font-size:12px;font-weight:700}.run-live-head h3{margin:3px 0 4px;font-size:22px}.run-live-head p{margin:0;color:var(--eb-muted)}.run-live-head form{flex:0 0 auto;margin:0}.run-live-head input{min-height:38px}
.run-live-metrics{display:grid;grid-template-columns:repeat(4,minmax(0,1fr));gap:9px;margin-top:12px}.run-live-metric{padding:12px;border:1px solid var(--eb-line-soft);border-radius:9px;background:var(--eb-soft)}.run-live-metric span{display:block;color:var(--eb-muted);font-size:12px}.run-live-metric b{display:block;margin-top:3px;font-size:18px;overflow-wrap:anywhere}
.run-live-grid{display:grid;grid-template-columns:minmax(260px,.8fr) minmax(0,1.4fr);gap:12px;margin-top:12px}.run-current,.run-chart-card{padding:15px;border:1px solid var(--eb-line);border-radius:10px;background:#fff}.run-section-label{display:block;margin-bottom:5px;color:var(--eb-muted);font-size:12px;font-weight:700}.run-current-head{display:flex;align-items:center;justify-content:space-between;gap:10px}.run-current-head h3{margin:0;font-size:19px}.run-current-head .tag{flex:0 0 auto}.run-progress{height:10px;margin:13px 0 8px;border-radius:999px;background:var(--eb-line-soft);overflow:hidden}.run-progress span{display:block;height:100%;width:0;border-radius:inherit;background:var(--eb-primary);transition:width .25s ease}.run-current-detail{display:flex;justify-content:space-between;gap:10px;color:var(--eb-muted);font-size:13px}.run-flow-facts{display:grid;grid-template-columns:repeat(2,minmax(0,1fr));gap:8px;margin-top:13px}.run-flow-fact{padding:9px 10px;border-radius:8px;background:var(--eb-soft)}.run-flow-fact span{display:block;color:var(--eb-muted);font-size:11px}.run-flow-fact b{display:block;margin-top:2px;font-size:14px}.run-chart-card{min-width:0}.run-chart-head{display:flex;align-items:flex-start;justify-content:space-between;gap:12px;margin-bottom:8px}.run-chart-head h3{margin:0;font-size:16px}.run-chart-head span{color:var(--eb-muted);font-size:12px}.run-chart-wrap{position:relative;min-height:190px}.run-chart-wrap canvas{display:block;width:100%;height:190px}.run-chart-empty{position:absolute;inset:0;display:flex;align-items:center;justify-content:center;color:var(--eb-muted);font-size:13px;pointer-events:none}
.run-steps{display:grid;gap:8px;margin-top:12px}.run-step{display:grid;grid-template-columns:34px minmax(0,1fr) auto;gap:10px;align-items:center;padding:10px 12px;border:1px solid var(--eb-line-soft);border-radius:9px;background:#fff}.run-step-icon{display:flex;align-items:center;justify-content:center;width:28px;height:28px;border-radius:50%;background:var(--eb-soft);color:var(--eb-muted);font-size:12px;font-weight:750}.run-step.current{border-color:#9fc8d0;background:var(--eb-primary-soft)}.run-step.current .run-step-icon{background:var(--eb-primary);color:#fff}.run-step.complete .run-step-icon{background:var(--eb-ok);color:#fff}.run-step-main b,.run-step-main small{display:block}.run-step-main small,.run-step-detail{color:var(--eb-muted);font-size:12px}.run-step-detail{text-align:right}
.run-plan-list{display:grid;gap:12px}.run-plan-card{padding:15px;border:1px solid #cfe1e5;border-radius:10px;background:linear-gradient(135deg,#f6fbfc,#fff 58%)}.run-plan-head{display:flex;align-items:flex-start;justify-content:space-between;gap:14px}.run-plan-title{min-width:0}.run-plan-title-row{display:flex;align-items:center;flex-wrap:wrap;gap:8px}.run-plan-title h3{margin:0;font-size:18px}.run-plan-title small{display:block;margin-top:3px;color:var(--eb-muted)}.run-plan-head form{flex:0 0 auto;margin:0}.run-plan-body{display:grid;grid-template-columns:minmax(170px,.65fr) minmax(0,2fr);gap:16px;margin-top:13px;padding-top:13px;border-top:1px solid var(--eb-line-soft)}.run-plan-label{display:block;margin-bottom:7px;color:var(--eb-muted);font-size:12px;font-weight:650}.run-plan-times{display:flex;flex-wrap:wrap;gap:6px}.run-plan-time{padding:4px 9px;border:1px solid #cfe1e5;border-radius:999px;background:#fff;color:var(--eb-primary);font-size:13px;font-weight:650}.run-plan-zones{display:grid;grid-template-columns:repeat(auto-fit,minmax(140px,1fr));gap:6px}.run-plan-zone{display:flex;justify-content:space-between;gap:8px;padding:7px 9px;border:1px solid var(--eb-line-soft);border-radius:7px;background:#fff;font-size:13px}.run-plan-zone span:last-child{color:var(--eb-primary);font-weight:650;white-space:nowrap}.run-plan-zone.zero span:last-child{color:var(--eb-muted);font-weight:500}
.run-custom-entry{display:flex;align-items:center;justify-content:space-between;gap:18px;padding:16px;border:1px solid #cfe1e5;border-radius:10px;background:linear-gradient(135deg,#f6fbfc,#fff)}.run-custom-entry h3{margin:0 0 4px;font-size:17px}.run-custom-entry p{margin:0;color:var(--eb-muted)}.run-custom-modal{width:min(720px,calc(100vw - 28px));padding:20px!important}.run-custom-modal>p{margin-top:-2px}.run-custom-grid{display:grid;grid-template-columns:repeat(2,minmax(0,1fr));gap:9px;margin-top:14px}.run-custom-zone{display:grid;grid-template-columns:minmax(0,1fr) 110px auto;gap:8px;align-items:center;padding:10px 11px;border:1px solid var(--eb-line-soft);border-radius:8px;background:var(--eb-soft)}.run-custom-zone label{margin:0;overflow-wrap:anywhere}.run-custom-zone input{width:100%;max-width:none;min-height:38px;margin:0}.run-custom-zone span{color:var(--eb-muted);font-weight:650}.run-custom-summary{margin-top:12px;padding:11px 13px;border:1px solid #cbdde5;border-radius:8px;background:var(--eb-info-soft)}.run-custom-summary b{display:block}.run-custom-summary span{display:block;margin-top:3px;color:var(--eb-muted);font-size:12px}.run-custom-modal .actions{margin-top:14px}
@media(max-width:900px){.run-live-metrics{grid-template-columns:repeat(2,minmax(0,1fr))}.run-live-grid,.run-plan-body{grid-template-columns:1fr}}
@media(max-width:760px){.run-idle-hero,.run-live-head,.run-plan-head,.run-custom-entry{align-items:stretch;flex-direction:column}.run-live-head form input,.run-plan-head form input,.run-custom-entry button{width:100%}.run-live-metrics{grid-template-columns:repeat(2,minmax(0,1fr))}.run-live-grid{grid-template-columns:1fr}.run-step{grid-template-columns:30px minmax(0,1fr)}.run-step-detail{grid-column:2;text-align:left}.run-custom-modal{width:calc(100vw - 20px);padding:14px!important}.run-custom-grid{grid-template-columns:1fr}.run-custom-zone{grid-template-columns:minmax(0,1fr) 90px auto}.run-custom-modal .actions{display:grid;grid-template-columns:1fr 1fr}.run-custom-modal .actions button,.run-custom-modal .actions input{width:100%;margin:0}}
@media(max-width:420px){.run-live-metrics,.run-flow-facts{grid-template-columns:1fr}.run-plan-zones{grid-template-columns:1fr}}
</style>)HTML");
    const IrrigationConfig* config = g_app->configuration();
    const WateringStatus status = g_app->wateringStatus();
    if (status.active) {
        const WateringPlan* activePlan = nullptr;
        if (config && status.planId >= 1 && status.planId <= config->plans.size() &&
            config->plans[status.planId - 1U].configured) {
            activePlan = &config->plans[status.planId - 1U];
        }
        const char* taskName = "自定义浇水";
        const char* taskSource = status.source == WateringSource::AutomaticPlan
                                     ? "自动计划"
                                     : (status.source == WateringSource::ManualPlan
                                            ? "手动启动计划"
                                            : "自定义浇水");
        if (status.purpose == WateringPurpose::FlowCalibration) {
            taskName = "流量计校准";
            taskSource = "维护任务";
        } else if (status.purpose == WateringPurpose::ZoneFlowLearning) {
            taskName = "基准流量学习";
            taskSource = "维护任务";
        } else if (activePlan) {
            taskName = activePlan->name.data();
        }
        const char* activeZoneName = "—";
        if (config && status.activeZoneId >= 1 && status.activeZoneId <= config->zones.size()) {
            activeZoneName = config->zones[status.activeZoneId - 1U].name.data();
        }
        const uint32_t currentTargetSec = status.currentStepIndex < status.stepCount
                                              ? status.zones[status.currentStepIndex].plannedDurationSec
                                              : 0U;
        const uint32_t progress = currentTargetSec == 0
                                      ? 0U
                                      : (status.currentZoneElapsedSec >= currentTargetSec
                                             ? 100U
                                             : status.currentZoneElapsedSec * 100U / currentTargetSec);
        Esp32BaseWeb::beginPanel("当前运行");
        Esp32BaseWeb::sendChunk("<div id='run-live' data-generation='"); sendUnsigned(status.flowHistoryGeneration);
        Esp32BaseWeb::sendChunk("' data-serial='"); sendUnsigned(status.flowSampleSerial);
        Esp32BaseWeb::sendChunk("'><div class='run-live-head'><div><span>"); Esp32BaseWeb::writeHtmlEscaped(taskSource);
        Esp32BaseWeb::sendChunk("</span><h3>"); Esp32BaseWeb::writeHtmlEscaped(taskName);
        Esp32BaseWeb::sendChunk("</h3><p id='run-state'>"); Esp32BaseWeb::writeHtmlEscaped(wateringStateName(status.state));
        Esp32BaseWeb::sendChunk(status.flowEstablished ? " · 水流已建立" : " · 等待水流建立");
        Esp32BaseWeb::sendChunk("</p></div><form method='post' action='/irrigation/run' onsubmit=\"return confirm('确认停止当前整次浇水任务？')&&once(this)\"><input type='hidden' name='action' value='stop'><input class='danger' type='submit' value='停止当前任务'></form></div>");
        Esp32BaseWeb::sendChunk("<div class='run-live-metrics'><div class='run-live-metric'><span>整次已运行</span><b id='run-elapsed'>"); sendDuration(status.elapsedSec);
        Esp32BaseWeb::sendChunk("</b></div><div class='run-live-metric'><span>预计剩余浇水</span><b id='run-remaining'>"); sendDuration(status.plannedRemainingSec);
        Esp32BaseWeb::sendChunk("</b></div><div class='run-live-metric'><span>累计估算水量</span><b id='run-water'>"); sendLiters(status.totalEstimatedWaterMl);
        Esp32BaseWeb::sendChunk("</b></div><div class='run-live-metric'><span>执行进度</span><b id='run-step-count'>第 "); sendUnsigned(status.currentStepIndex + 1U); Esp32BaseWeb::sendChunk(" / "); sendUnsigned(status.stepCount);
        Esp32BaseWeb::sendChunk(" 条水路</b></div></div><div class='run-live-grid'><div class='run-current'><span class='run-section-label'>当前水路</span><div class='run-current-head'><h3 id='run-current-zone'>"); Esp32BaseWeb::writeHtmlEscaped(activeZoneName);
        Esp32BaseWeb::sendChunk("</h3><span id='run-flow-state' class='tag "); Esp32BaseWeb::sendChunk(status.flowEstablished ? "ok'>水流正常" : "warn'>等待水流");
        Esp32BaseWeb::sendChunk("</span></div><div class='run-progress'><span id='run-current-progress' style='width:"); sendUnsigned(progress);
        Esp32BaseWeb::sendChunk("%'></span></div><div class='run-current-detail'><span id='run-current-elapsed'>"); sendDuration(status.currentZoneElapsedSec);
        Esp32BaseWeb::sendChunk(" / "); sendDuration(currentTargetSec);
        Esp32BaseWeb::sendChunk("</span><span id='run-current-remaining'>剩余 "); sendDuration(status.currentZoneRemainingSec);
        Esp32BaseWeb::sendChunk("</span></div><div class='run-flow-facts'><div class='run-flow-fact'><span>当前流量</span><b id='run-flow'>");
        char flowText[20]{}; IrrigationConfigRules::formatLitersPerMinute(status.currentFlowMlPerMinute, flowText, sizeof(flowText)); Esp32BaseWeb::writeHtmlEscaped(flowText);
        Esp32BaseWeb::sendChunk(" L/min</b></div><div class='run-flow-fact'><span>基准流量</span><b id='run-expected-flow'>");
        if (status.expectedFlowMlPerMinute == 0) Esp32BaseWeb::sendChunk("未设置");
        else { char expected[20]{}; IrrigationConfigRules::formatLitersPerMinute(status.expectedFlowMlPerMinute, expected, sizeof(expected)); Esp32BaseWeb::writeHtmlEscaped(expected); Esp32BaseWeb::sendChunk(" L/min"); }
        Esp32BaseWeb::sendChunk("</b></div><div class='run-flow-fact'><span>当前水路脉冲</span><b id='run-pulses'>"); sendUnsigned(status.pulseCount);
        Esp32BaseWeb::sendChunk("</b></div><div class='run-flow-fact'><span>当前水路估算水量</span><b id='run-zone-water'>");
        if (status.currentStepIndex < status.stepCount) sendLiters(status.zones[status.currentStepIndex].estimatedWaterMl); else Esp32BaseWeb::sendChunk("0.000 L");
        Esp32BaseWeb::sendChunk("</b></div></div></div><div class='run-chart-card'><div class='run-chart-head'><div><span class='run-section-label'>当前水路</span><h3>最近 10 分钟流量</h3></div><span>每 5 秒采样</span></div><div class='run-chart-wrap'><canvas id='run-flow-chart' height='190'></canvas><div id='run-chart-empty' class='run-chart-empty'>正在等待流量数据</div></div></div></div><div class='run-steps'>");
        for (uint8_t index = 0; index < status.stepCount; ++index) {
            const ZoneWateringSummary& zone = status.zones[index];
            const char* stepClass = index < status.currentStepIndex ? " complete" : (index == status.currentStepIndex ? " current" : "");
            Esp32BaseWeb::sendChunk("<div class='run-step"); Esp32BaseWeb::sendChunk(stepClass); Esp32BaseWeb::sendChunk("' data-step-index='"); sendUnsigned(index);
            Esp32BaseWeb::sendChunk("' data-zone-id='"); sendUnsigned(zone.zoneId); Esp32BaseWeb::sendChunk("'><span class='run-step-icon'>");
            if (index < status.currentStepIndex) Esp32BaseWeb::sendChunk("&#10003;"); else sendUnsigned(index + 1U);
            Esp32BaseWeb::sendChunk("</span><div class='run-step-main'><b class='run-step-name'>");
            if (config && zone.zoneId >= 1 && zone.zoneId <= config->zones.size()) Esp32BaseWeb::writeHtmlEscaped(config->zones[zone.zoneId - 1U].name.data()); else { Esp32BaseWeb::sendChunk("水路 "); sendUnsigned(zone.zoneId); }
            Esp32BaseWeb::sendChunk("</b><small>计划 "); sendDuration(zone.plannedDurationSec); Esp32BaseWeb::sendChunk("</small></div><span class='run-step-detail'>");
            if (index < status.currentStepIndex) { Esp32BaseWeb::sendChunk("实际 "); sendDuration(zone.actualWateringSec); Esp32BaseWeb::sendChunk(" · "); sendLiters(zone.estimatedWaterMl); }
            else if (index == status.currentStepIndex) { Esp32BaseWeb::sendChunk("正在执行 · 剩余 "); sendDuration(status.currentZoneRemainingSec); }
            else Esp32BaseWeb::sendChunk("等待执行");
            Esp32BaseWeb::sendChunk("</span></div>");
        }
        Esp32BaseWeb::sendChunk("</div><p class='muted' style='margin:10px 0 0'>预计剩余时间只计算计划浇水时长，不包含等待水流和设备启停延时。</p></div>");
        Esp32BaseWeb::endPanel();
    } else {
        Esp32BaseWeb::beginPanel("当前状态");
        Esp32BaseWeb::sendChunk("<div class='run-idle-hero'><div><h3>当前空闲</h3><p>没有正在执行的任务，可以选择已有计划或自定义本次浇水。</p></div><span class='tag ok'>可以开始浇水</span></div>");
        Esp32BaseWeb::endPanel();
    }
    if (config && !status.active) {
        Esp32BaseWeb::beginPanel("按计划手动浇水");
        bool hasPlan = false;
        Esp32BaseWeb::sendChunk("<div class='run-plan-list'>");
        for (const WateringPlan& plan : config->plans) {
            if (!plan.configured) continue;
            hasPlan = true;
            uint16_t totalMinutes = 0;
            uint8_t zoneCount = 0;
            for (uint8_t index = 0; index < plan.zoneDurationMinutes.size(); ++index) {
                if (!config->zones[index].enabled || plan.zoneDurationMinutes[index] == 0) continue;
                totalMinutes = static_cast<uint16_t>(totalMinutes + plan.zoneDurationMinutes[index]);
                ++zoneCount;
            }
            Esp32BaseWeb::sendChunk("<article class='run-plan-card'><div class='run-plan-head'><div class='run-plan-title'><div class='run-plan-title-row'><h3>");
            Esp32BaseWeb::writeHtmlEscaped(plan.name.data());
            Esp32BaseWeb::sendChunk("</h3><span class='tag "); Esp32BaseWeb::sendChunk(plan.scheduleEnabled ? "ok'>自动执行" : "'>仅手动");
            Esp32BaseWeb::sendChunk("</span></div><small>"); sendUnsigned(zoneCount); Esp32BaseWeb::sendChunk(" 条水路 · 合计 "); sendUnsigned(totalMinutes); Esp32BaseWeb::sendChunk(" 分钟</small></div><form method='post' action='/irrigation/run' onsubmit=\"return confirm('确认立即按此计划开始浇水？')&&once(this)\"><input type='hidden' name='action' value='start_plan'><input type='hidden' name='plan_id' value='");
            sendUnsigned(plan.id);
            Esp32BaseWeb::sendChunk("'><input type='submit' value='"); Esp32BaseWeb::sendChunk(zoneCount == 0 ? "当前不可运行' disabled" : "按此计划开始浇水'");
            Esp32BaseWeb::sendChunk("></form></div><div class='run-plan-body'><section><span class='run-plan-label'>每日启动时间</span><div class='run-plan-times'>");
            bool hasTime = false;
            for (uint16_t minute : plan.startMinutes) {
                if (minute == kUnusedStartMinute) continue;
                hasTime = true;
                char time[8]; std::snprintf(time, sizeof(time), "%02u:%02u", minute / 60U, minute % 60U);
                Esp32BaseWeb::sendChunk("<span class='run-plan-time'>"); Esp32BaseWeb::sendChunk(time); Esp32BaseWeb::sendChunk("</span>");
            }
            if (!hasTime) Esp32BaseWeb::sendChunk("<span class='muted'>未设置</span>");
            Esp32BaseWeb::sendChunk("</div></section><section><span class='run-plan-label'>各水路浇水时长</span><div class='run-plan-zones'>");
            for (uint8_t index = 0; index < plan.zoneDurationMinutes.size(); ++index) {
                if (!config->zones[index].enabled) continue;
                Esp32BaseWeb::sendChunk("<div class='run-plan-zone"); if (plan.zoneDurationMinutes[index] == 0) Esp32BaseWeb::sendChunk(" zero");
                Esp32BaseWeb::sendChunk("'><span>"); Esp32BaseWeb::writeHtmlEscaped(config->zones[index].name.data()); Esp32BaseWeb::sendChunk("</span><span>"); sendUnsigned(plan.zoneDurationMinutes[index]); Esp32BaseWeb::sendChunk(" 分钟</span></div>");
            }
            Esp32BaseWeb::sendChunk("</div></section></div></article>");
        }
        Esp32BaseWeb::sendChunk("</div>");
        if (!hasPlan) {
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "尚未配置浇水计划", "新增计划后可在这里一键启动整套浇水流程。");
            Esp32BaseWeb::sendChunk("<div class='actions'><a class='btnlink info' href='/irrigation/plans'>前往新增计划</a></div>");
        }
        Esp32BaseWeb::endPanel();
        Esp32BaseWeb::beginPanel("自定义浇水");
        Esp32BaseWeb::sendChunk("<div class='run-custom-entry'><div><h3>临时设置本次浇水</h3><p>按需设置各水路时长，不会修改已经保存的浇水计划。</p></div><button type='button' onclick=\"document.getElementById('run-custom-modal').showModal()\">自定义浇水</button></div>");
        Esp32BaseWeb::endPanel();
        Esp32BaseWeb::sendChunk("<dialog id='run-custom-modal' class='panel eb-modal run-custom-modal' data-eb-light-dismiss='1'><h2>自定义浇水</h2><p class='muted'>只设置本次需要执行的水路；系统会按水路编号依次浇水。</p><form id='run-custom-form' method='post' action='/irrigation/run' onsubmit='return runCustomSubmit(this)'><input type='hidden' name='action' value='start_zones'><div class='run-custom-grid'>");
        for (uint8_t index = 0; index < config->zones.size(); ++index) {
            if (!config->zones[index].enabled) continue;
            Esp32BaseWeb::sendChunk("<div class='run-custom-zone'><label>");
            Esp32BaseWeb::writeHtmlEscaped(config->zones[index].name.data());
            Esp32BaseWeb::sendChunk("</label><input class='run-custom-duration' type='number' min='0' max='120' name='zone"); sendUnsigned(index + 1U);
            Esp32BaseWeb::sendChunk("' value='0' inputmode='numeric'><span>分钟</span></div>");
        }
        Esp32BaseWeb::sendChunk("</div><div class='run-custom-summary'><b id='run-custom-summary'>尚未选择水路</b><span>每条水路范围 0～120 分钟，0 表示本次不执行。</span></div><div class='actions'><button type='button' class='secondary' onclick='this.closest(\"dialog\").close()'>取消</button><input id='run-custom-submit' type='submit' value='确认并开始浇水' disabled></div></form></dialog>");
    }
