tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
    Esp32BaseWeb::sendChunk("<script>(function(){var live=document.getElementById('run-live'),initialActive=!!live;function duration(v){v=Math.max(0,Number(v)||0);if(v<60)return v+' 秒';if(v<3600)return Math.floor(v/60)+' 分 '+(v%60)+' 秒';return Math.floor(v/3600)+' 小时 '+Math.floor((v%3600)/60)+' 分'}function liters(v){return((Number(v)||0)/1000).toFixed(3)+' L'}function flow(v){return((Number(v)||0)/1000).toFixed(3)+' L/min'}function set(id,v){var e=document.getElementById(id);if(e)e.textContent=v}var inputs=document.querySelectorAll('.run-custom-duration'),submit=document.getElementById('run-custom-submit');function updateCustom(){var count=0,total=0;inputs.forEach(function(i){var v=Math.max(0,Math.min(120,Number(i.value)||0));if(v>0){count++;total+=v}});set('run-custom-summary',count?('已选择 '+count+' 条水路 · 合计 '+total+' 分钟'):'尚未选择水路');if(submit)submit.disabled=count===0}inputs.forEach(function(i){i.addEventListener('input',updateCustom)});window.runCustomSubmit=function(form){updateCustom();if(!submit||submit.disabled){alert('请至少为一条水路设置大于 0 的时长。');return false}return confirm('确认按当前自定义时长立即开始浇水？')&&once(form)};updateCustom();if(!initialActive){function idlePoll(){fetch('/irrigation/api/status',{cache:'no-store',credentials:'same-origin'}).then(function(r){return r.json()}).then(function(s){if(s.active)location.reload();else setTimeout(idlePoll,2000)}).catch(function(){setTimeout(idlePoll,3000)})}setTimeout(idlePoll,2000);return}var canvas=document.getElementById('run-flow-chart'),empty=document.getElementById('run-chart-empty'),samples=[],generation=Number(live.dataset.generation||0),serial=Number(live.dataset.serial||0);function draw(){if(!canvas)return;var rect=canvas.getBoundingClientRect(),dpr=window.devicePixelRatio||1,w=Math.max(280,rect.width),h=190;canvas.width=w*dpr;canvas.height=h*dpr;var c=canvas.getContext('2d');c.scale(dpr,dpr);c.clearRect(0,0,w,h);c.strokeStyle='#d8e2e7';c.lineWidth=1;c.beginPath();c.moveTo(42,12);c.lineTo(42,h-28);c.lineTo(w-10,h-28);c.stroke();if(samples.length===0){if(empty)empty.style.display='flex';return}if(empty)empty.style.display='none';var max=Math.max.apply(null,samples.concat([1000]))*1.12;c.fillStyle='#667085';c.font='11px sans-serif';c.fillText((max/1000).toFixed(2)+' L/min',2,14);c.fillText('10分钟前',42,h-8);c.fillText('现在',w-34,h-8);c.strokeStyle='#117b8b';c.lineWidth=2;c.beginPath();samples.forEach(function(v,i){var x=42+(w-52)*(samples.length===1?1:i/(samples.length-1)),y=12+(h-40)*(1-v/max);if(i===0)c.moveTo(x,y);else c.lineTo(x,y)});c.stroke()}function loadHistory(){fetch('/irrigation/api/flow-history',{cache:'no-store',credentials:'same-origin'}).then(function(r){return r.json()}).then(function(h){samples=Array.isArray(h.samples)?h.samples.slice(-120):[];generation=Number(h.generation||0);serial=Number(h.latestSerial||0);draw()}).catch(function(){setTimeout(loadHistory,2000)})}function update(s){set('run-elapsed',duration(s.elapsedSec));set('run-remaining',duration(s.plannedRemainingSec));set('run-water',liters(s.totalEstimatedWaterMl));set('run-step-count','第 '+(Number(s.currentStepIndex)+1)+' / '+s.stepCount+' 条水路');var states=['空闲','区域启动中','等待水流','正在浇水','区域停止中'];set('run-state',(states[s.state]||'未知')+(s.flowEstablished?' · 水流已建立':' · 等待水流建立'));set('run-current-elapsed',duration(s.currentZoneElapsedSec)+' / '+duration((s.zones[s.currentStepIndex]||{}).plannedDurationSec));set('run-current-remaining','剩余 '+duration(s.currentZoneRemainingSec));set('run-flow',flow(s.currentFlowMlPerMinute));set('run-expected-flow',s.expectedFlowMlPerMinute?flow(s.expectedFlowMlPerMinute):'未设置');set('run-pulses',s.pulseCount);set('run-zone-water',liters((s.zones[s.currentStepIndex]||{}).estimatedWaterMl));var current=document.querySelector('[data-step-index=\"'+s.currentStepIndex+'\"]');if(current){var name=current.querySelector('.run-step-name');set('run-current-zone',name?name.textContent:'水路 '+s.zoneId)}var target=Number((s.zones[s.currentStepIndex]||{}).plannedDurationSec)||0,percent=target?Math.min(100,Math.round(Number(s.currentZoneElapsedSec)*100/target)):0,bar=document.getElementById('run-current-progress');if(bar)bar.style.width=percent+'%';var flowState=document.getElementById('run-flow-state');if(flowState){flowState.textContent=s.flowEstablished?'水流正常':'等待水流';flowState.className='tag '+(s.flowEstablished?'ok':'warn')}document.querySelectorAll('.run-step').forEach(function(row){var i=Number(row.dataset.stepIndex),z=s.zones[i]||{},icon=row.querySelector('.run-step-icon'),detail=row.querySelector('.run-step-detail');row.classList.toggle('complete',i<s.currentStepIndex);row.classList.toggle('current',i===s.currentStepIndex);if(icon)icon.textContent=i<s.currentStepIndex?'✓':String(i+1);if(detail){if(i<s.currentStepIndex)detail.textContent='实际 '+duration(z.actualWateringSec)+' · '+liters(z.estimatedWaterMl);else if(i===s.currentStepIndex)detail.textContent='正在执行 · 剩余 '+duration(s.currentZoneRemainingSec);else detail.textContent='等待执行'}});var nextGeneration=Number(s.flowHistoryGeneration||0),nextSerial=Number(s.flowSampleSerial||0);if(nextGeneration!==generation){generation=nextGeneration;loadHistory()}else if(nextSerial!==serial){if(nextSerial===serial+1){samples.push(Number(s.currentFlowMlPerMinute)||0);if(samples.length>120)samples.shift();serial=nextSerial;draw()}else loadHistory()}}function poll(){fetch('/irrigation/api/status',{cache:'no-store',credentials:'same-origin'}).then(function(r){return r.json()}).then(function(s){if(!s.active){location.reload();return}update(s);setTimeout(poll,1000)}).catch(function(){setTimeout(poll,2000)})}window.addEventListener('resize',draw);loadHistory();setTimeout(poll,1000)})();</script>");
    endPage();
}

void IrrigationWeb::plans() {
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        if (!Esp32BaseWeb::checkPostAllowed("irrigation_plan_save")) return;
        redirectResult("/irrigation/plans", savePlanFromRequest());
        return;
    }
    if (!beginPage("浇水计划", "查看计划的执行时间和各水路时长，点击编辑可修改配置")) return;
    Esp32BaseWeb::sendChunk(
        "<style>"
        ".plan-toolbar{display:flex;align-items:center;justify-content:flex-end;margin:-4px 0 12px}"
        ".plan-toolbar .btnlink{min-height:36px}"
        ".plan-list{display:grid;gap:12px}"
        ".plan-card{padding:16px;border:1px solid #cfe1e5;border-radius:10px;background:linear-gradient(135deg,#f6fbfc 0,#fff 58%)}"
        ".plan-card-head{display:flex;align-items:flex-start;justify-content:space-between;gap:16px}"
        ".plan-card-title{min-width:0}.plan-card-title-row{display:flex;align-items:center;flex-wrap:wrap;gap:8px}"
        ".plan-card-title h3{margin:0;font-size:18px;line-height:1.35;overflow-wrap:anywhere}"
        ".plan-card-title small{display:block;margin-top:3px;color:var(--eb-muted)}"
        ".plan-card-edit{flex:0 0 auto;min-width:68px}"
        ".plan-card-body{display:grid;grid-template-columns:minmax(170px,.65fr) minmax(0,2fr);gap:18px;margin-top:14px;padding-top:14px;border-top:1px solid var(--eb-line-soft)}"
        ".plan-summary-label{display:block;margin-bottom:7px;color:var(--eb-muted);font-size:12px;font-weight:650}"
        ".plan-time-list{display:flex;flex-wrap:wrap;gap:7px}"
        ".plan-time-chip{display:inline-flex;align-items:center;min-height:30px;padding:4px 10px;border:1px solid #cfe1e5;border-radius:999px;background:#fff;color:var(--eb-primary);font-weight:650;font-variant-numeric:tabular-nums}"
        ".plan-empty-value{color:var(--eb-muted)}"
        ".plan-zone-summary{display:grid;grid-template-columns:repeat(auto-fit,minmax(145px,1fr));gap:7px}"
        ".plan-zone-item{display:flex;align-items:baseline;justify-content:space-between;gap:10px;padding:8px 10px;border:1px solid var(--eb-line-soft);border-radius:7px;background:#fff}"
        ".plan-zone-item b{min-width:0;font-size:13px;font-weight:600;overflow-wrap:anywhere}.plan-zone-item span{flex:0 0 auto;color:var(--eb-primary);font-weight:650;white-space:nowrap}"
        ".plan-zone-item.zero span{color:var(--eb-muted);font-weight:500}"
        ".plan-modal{width:min(820px,calc(100vw - 28px))}"
        ".plan-editor{display:grid;gap:14px;margin-top:12px}"
        ".plan-group{padding:14px;border:1px solid var(--eb-line);border-radius:9px;background:var(--eb-soft)}"
        ".plan-group h3{margin:0 0 3px;font-size:15px}"
        ".plan-group>small{display:block;margin-bottom:12px;color:var(--eb-muted)}"
        ".plan-basic{display:grid;grid-template-columns:minmax(0,2fr) minmax(220px,1fr);gap:14px}"
        ".plan-basic .field,.plan-zone{margin:0}"
        ".plan-basic input[type=text]{margin-bottom:0}"
        ".plan-switch{padding:10px 12px;border:1px solid var(--eb-line-soft);border-radius:8px;background:#fff}"
        ".plan-switch label{display:flex;align-items:center;gap:8px;margin:0}"
        ".plan-switch small{display:block;margin-top:5px;color:var(--eb-muted)}"
        ".plan-times,.plan-zones{display:grid;grid-template-columns:repeat(2,minmax(0,1fr));gap:10px}"
        ".plan-time,.plan-zone{padding:10px 12px;border:1px solid var(--eb-line-soft);border-radius:8px;background:#fff}"
        ".plan-time-row{display:grid;grid-template-columns:minmax(0,1fr) auto;gap:8px;align-items:center}"
        ".plan-time input[type=time]{width:100%;min-width:0;min-height:34px;margin:0;padding:5px 8px}"
        ".plan-time .clear-time{min-width:56px}"
        ".plan-zone input{width:100%;max-width:none;margin:0}"
        ".plan-zone small{display:block;margin-top:5px;color:var(--eb-muted)}"
        ".plan-form-actions{padding-top:2px}"
        "@media(max-width:760px){"
        ".plan-toolbar{margin-top:0}.plan-toolbar .btnlink{width:100%}"
        ".plan-card{padding:13px}.plan-card-head{gap:10px}.plan-card-title h3{font-size:17px}.plan-card-edit{min-width:60px}"
        ".plan-card-body{grid-template-columns:1fr;gap:13px;margin-top:12px;padding-top:12px}"
        ".plan-zone-summary{grid-template-columns:repeat(2,minmax(0,1fr))}"
        ".plan-modal{width:calc(100vw - 20px)}"
        ".plan-basic,.plan-times,.plan-zones{grid-template-columns:1fr}"
        ".plan-group{padding:12px}"
        "}"
        "</style>");
    const IrrigationConfig* config = g_app->configuration();
    if (config) {
        int firstAvailable = -1;
        bool anyConfigured = false;
        for (const WateringPlan& plan : config->plans) {
            if (plan.configured) anyConfigured = true;
            else if (firstAvailable < 0) firstAvailable = plan.id - 1;
        }
        Esp32BaseWeb::beginPanel("已有计划");
        if (firstAvailable >= 0) {
            Esp32BaseWeb::sendChunk("<div class='plan-toolbar'><button type='button' class='btnlink' onclick=\"document.getElementById('plan-"); sendUnsigned(firstAvailable + 1U);
            Esp32BaseWeb::sendChunk("').showModal()\">新增计划</button></div>");
        }
        if (anyConfigured) Esp32BaseWeb::sendChunk("<div class='plan-list'>");
        for (const WateringPlan& plan : config->plans) {
            if (!plan.configured) continue;
            Esp32BaseWeb::sendChunk("<article class='plan-card'><div class='plan-card-head'><div class='plan-card-title'><div class='plan-card-title-row'><h3>");
            Esp32BaseWeb::writeHtmlEscaped(plan.name.data());
            Esp32BaseWeb::sendChunk("</h3><span class='tag ");
            Esp32BaseWeb::sendChunk(plan.scheduleEnabled ? "ok'>自动执行" : "'>仅手动");
            Esp32BaseWeb::sendChunk("</span></div><small>计划 "); sendUnsigned(plan.id);
            Esp32BaseWeb::sendChunk("</small></div><button type='button' class='btnlink info compact plan-card-edit' onclick=\"document.getElementById('plan-"); sendUnsigned(plan.id);
            Esp32BaseWeb::sendChunk("').showModal()\">编辑</button></div><div class='plan-card-body'><section><span class='plan-summary-label'>每日启动时间</span><div class='plan-time-list'>");
            bool hasStartTime = false;
            for (uint16_t minute : plan.startMinutes) {
                if (minute == kUnusedStartMinute) continue;
                hasStartTime = true;
                char time[8];
                std::snprintf(time, sizeof(time), "%02u:%02u", minute / 60U, minute % 60U);
                Esp32BaseWeb::sendChunk("<span class='plan-time-chip'>"); Esp32BaseWeb::sendChunk(time); Esp32BaseWeb::sendChunk("</span>");
            }
            if (!hasStartTime) Esp32BaseWeb::sendChunk("<span class='plan-empty-value'>未设置</span>");
            Esp32BaseWeb::sendChunk("</div></section><section><span class='plan-summary-label'>各水路浇水时长</span><div class='plan-zone-summary'>");
            bool hasEnabledZone = false;
            for (uint8_t index = 0; index < plan.zoneDurationMinutes.size(); ++index) {
                if (!config->zones[index].enabled) continue;
                hasEnabledZone = true;
                Esp32BaseWeb::sendChunk("<div class='plan-zone-item");
                if (plan.zoneDurationMinutes[index] == 0) Esp32BaseWeb::sendChunk(" zero");
                Esp32BaseWeb::sendChunk("'><b>"); Esp32BaseWeb::writeHtmlEscaped(config->zones[index].name.data());
                Esp32BaseWeb::sendChunk("</b><span>"); sendUnsigned(plan.zoneDurationMinutes[index]); Esp32BaseWeb::sendChunk(" 分钟</span></div>");
            }
            if (!hasEnabledZone) Esp32BaseWeb::sendChunk("<span class='plan-empty-value'>暂无启用水路</span>");
            Esp32BaseWeb::sendChunk("</div></section></div></article>");
        }
        if (anyConfigured) Esp32BaseWeb::sendChunk("</div>");
        else Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "尚无浇水计划", "新增后可用于手动浇水或定时自动执行。");
        Esp32BaseWeb::endPanel();

