tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
        for (const WateringPlan& plan : config->plans) {
            if (!plan.configured && static_cast<int>(plan.id - 1U) != firstAvailable) continue;
            Esp32BaseWeb::sendChunk("<dialog id='plan-"); sendUnsigned(plan.id);
            Esp32BaseWeb::sendChunk("' class='panel eb-modal plan-modal' data-eb-light-dismiss='1'><h2>");
            Esp32BaseWeb::writeHtmlEscaped(plan.configured ? "编辑浇水计划" : "新增浇水计划");
            Esp32BaseWeb::sendChunk("</h2><form method='post' action='/irrigation/plans' onsubmit='return once(this)'><input type='hidden' name='action' value='save'><input type='hidden' name='plan_id' value='"); sendUnsigned(plan.id);
            Esp32BaseWeb::sendChunk("'><input type='hidden' name='revision' value='"); sendUnsigned(config->revision);
            Esp32BaseWeb::sendChunk("'><div class='plan-editor'><section class='plan-group'><h3>基本信息</h3><small>计划名称用于运行和浇水记录；自动执行关闭后仍可手动启动。</small><div class='plan-basic'><p class='field'><label>计划名称</label><input type='text' name='name' maxlength='63' required value='");
            Esp32BaseWeb::writeHtmlEscaped(plan.name.data());
            Esp32BaseWeb::sendChunk("'></p><div class='plan-switch'><label><input type='checkbox' name='schedule_enabled' value='1' ");
            if (plan.scheduleEnabled) Esp32BaseWeb::sendChunk("checked");
            Esp32BaseWeb::sendChunk("> 自动执行</label><small>仅控制定时执行，不影响手动选择该计划。</small></div></div></section><section class='plan-group'><h3>自动执行时间</h3><small>每天最多执行 4 次；留空表示不使用。点击“清除”可删除已经设置的时间。</small><div class='plan-times'>");
            for (uint8_t index = 0; index < plan.startMinutes.size(); ++index) {
                Esp32BaseWeb::sendChunk("<div class='plan-time'><label>启动时间 "); sendUnsigned(index + 1U);
                Esp32BaseWeb::sendChunk("</label><div class='plan-time-row'><input type='time' name='time"); sendUnsigned(index + 1U); Esp32BaseWeb::sendChunk("' value='");
                if (plan.startMinutes[index] != kUnusedStartMinute) { char time[8]; std::snprintf(time, sizeof(time), "%02u:%02u", plan.startMinutes[index] / 60U, plan.startMinutes[index] % 60U); Esp32BaseWeb::sendChunk(time); }
                Esp32BaseWeb::sendChunk("'><button type='button' class='secondary clear-time' onclick=\"this.previousElementSibling.value=''\">清除</button></div></div>");
            }
            Esp32BaseWeb::sendChunk("</div></section><section class='plan-group'><h3>各水路浇水时长</h3><small>这里只显示已启用水路；设置为 0 分钟表示本计划不浇该水路。</small><div class='plan-zones'>");
            for (uint8_t index = 0; index < plan.zoneDurationMinutes.size(); ++index) {
                if (!config->zones[index].enabled) continue;
                Esp32BaseWeb::sendChunk("<p class='plan-zone'><label>"); Esp32BaseWeb::writeHtmlEscaped(config->zones[index].name.data());
                Esp32BaseWeb::sendChunk("</label><input type='number' name='zone"); sendUnsigned(index + 1U);
                Esp32BaseWeb::sendChunk("' min='0' max='120' value='"); sendUnsigned(plan.zoneDurationMinutes[index]);
                Esp32BaseWeb::sendChunk("'><small>单位：分钟，范围 0～120。</small></p>");
            }
            Esp32BaseWeb::sendChunk("</div></section></div><div class='actions plan-form-actions'><button type='button' class='secondary' onclick='this.closest(\"dialog\").close()'>取消</button><input type='submit' value='保存计划'></div></form>");
            if (plan.configured) { Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/plans' onsubmit=\"return confirm('确认删除该计划？')&&once(this)\"><input type='hidden' name='action' value='delete'><input type='hidden' name='plan_id' value='"); sendUnsigned(plan.id); Esp32BaseWeb::sendChunk("'><input type='hidden' name='revision' value='"); sendUnsigned(config->revision); Esp32BaseWeb::sendChunk("'><div class='actions'><input class='danger' type='submit' value='删除计划'></div></form>"); }
            Esp32BaseWeb::sendChunk("</dialog>");
        }
    }
    endPage();
}

void IrrigationWeb::zones() {
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        if (!Esp32BaseWeb::checkPostAllowed("irrigation_zone_save")) return;
        redirectResult("/irrigation/zones", actionIs("save") && saveZoneFromRequest());
        return;
    }
    if (!beginPage("水路设置", "启用实际安装的水路，并设置名称和基准流量")) return;
    Esp32BaseWeb::sendChunk(
        "<style>"
        ".zone-meter{display:grid;grid-template-columns:minmax(0,1fr) auto;gap:20px;align-items:center;padding:16px;border:1px solid #cfe1e5;border-radius:10px;background:linear-gradient(135deg,#f2f9fa,#fff)}"
        ".zone-meter-label{margin:0 0 5px;color:var(--eb-muted);font-size:13px}"
        ".zone-meter-value{display:flex;align-items:baseline;gap:7px;color:var(--eb-primary);line-height:1}"
        ".zone-meter-number{font-size:32px;font-weight:500;letter-spacing:-.02em}"
        ".zone-meter-unit{font-size:14px;color:var(--eb-muted)}"
        ".zone-meter-help{margin:8px 0 0;color:var(--eb-muted);font-size:13px}"
        ".zone-meter-actions{display:flex;flex-wrap:wrap;justify-content:flex-end;gap:8px}"
        ".zone-table th{font-weight:600}.zone-table td{font-weight:400}"
        ".zone-table .tag{font-weight:500}"
        ".zone-table .btnlink{font-weight:500}"
        "@media(max-width:760px){"
        ".zone-meter{grid-template-columns:1fr;padding:14px;gap:14px}"
        ".zone-meter-actions{justify-content:flex-start}"
        ".zone-meter-number{font-size:28px}"
        "}"
        "</style>");
    const IrrigationConfig* config = g_app->configuration();
    if (config) {
        char coefficient[20]{};
        IrrigationConfigRules::formatPulsesPerLiter(
            config->flowMeter.pulsesPerLiterX100, coefficient, sizeof(coefficient));
        Esp32BaseWeb::beginPanel("流量计参数");
        Esp32BaseWeb::sendChunk("<div class='zone-meter'><div><p class='zone-meter-label'>当前流量系数</p><div class='zone-meter-value'><span class='zone-meter-number'>");
        Esp32BaseWeb::writeHtmlEscaped(coefficient);
        Esp32BaseWeb::sendChunk("</span><span class='zone-meter-unit'>pulse/L</span></div><p class='zone-meter-help'>用于把流量计脉冲换算为实时流量和累计水量。</p></div><div class='zone-meter-actions'><a class='btnlink ok' href='/irrigation/zones/flow-calibration'>流量计校准</a></div></div>");
        Esp32BaseWeb::endPanel();
        Esp32BaseWeb::beginPanel("水路列表");
        Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part zone-table'><thead><tr><th>水路</th><th>名称</th><th>启用状态</th><th>基准流量</th><th>操作</th></tr></thead><tbody>");
        for (const ZoneConfig& zone : config->zones) {
            char value[20]{};
            if (zone.learnedFlowMlPerMinute != 0) {
                IrrigationConfigRules::formatLitersPerMinute(
                    zone.learnedFlowMlPerMinute, value, sizeof(value));
            }
            Esp32BaseWeb::sendChunk("<tr><td>水路 "); sendUnsigned(zone.id);
            Esp32BaseWeb::sendChunk("</td><td>"); Esp32BaseWeb::writeHtmlEscaped(zone.name.data());
            Esp32BaseWeb::sendChunk("</td><td><span class='tag ");
            Esp32BaseWeb::sendChunk(zone.enabled ? "ok'>已启用" : "'>未启用");
            Esp32BaseWeb::sendChunk("</span></td><td>");
            if (zone.learnedFlowMlPerMinute == 0) Esp32BaseWeb::sendChunk("<span class='muted'>未设置</span>");
            else { Esp32BaseWeb::writeHtmlEscaped(value); Esp32BaseWeb::sendChunk(" L/min"); }
            Esp32BaseWeb::sendChunk("</td><td><div class='fsactions'><button type='button' class='btnlink info compact' onclick=\"document.getElementById('zone-"); sendUnsigned(zone.id);
            Esp32BaseWeb::sendChunk("').showModal()\">修改</button>");
            if (zone.enabled) { Esp32BaseWeb::sendChunk("<a class='btnlink ok compact' href='/irrigation/zones/learning?zone="); sendUnsigned(zone.id); Esp32BaseWeb::sendChunk("'>学习基准流量</a>"); }
            Esp32BaseWeb::sendChunk("</div></td></tr>");
        }
        Esp32BaseWeb::sendChunk("</tbody></table></div>");
        Esp32BaseWeb::endPanel();
        for (const ZoneConfig& zone : config->zones) {
            char learnedFlow[20]{};
            IrrigationConfigRules::formatLitersPerMinute(
                zone.learnedFlowMlPerMinute, learnedFlow, sizeof(learnedFlow));
            Esp32BaseWeb::sendChunk("<dialog id='zone-"); sendUnsigned(zone.id);
            Esp32BaseWeb::sendChunk("' class='panel eb-modal' data-eb-light-dismiss='1'><h2>修改水路 "); sendUnsigned(zone.id);
            Esp32BaseWeb::sendChunk("</h2><form method='post' action='/irrigation/zones' onsubmit='return once(this)'><input type='hidden' name='action' value='save'><input type='hidden' name='zone_id' value='"); sendUnsigned(zone.id);
            Esp32BaseWeb::sendChunk("'><input type='hidden' name='revision' value='"); sendUnsigned(config->revision);
            Esp32BaseWeb::sendChunk("'><div class='fieldgrid'><p class='field full'><label>水路名称</label><input name='name' maxlength='63' required value='"); Esp32BaseWeb::writeHtmlEscaped(zone.name.data());
            Esp32BaseWeb::sendChunk("'><small>用于计划、运行和记录页面显示。</small></p><p class='field full'><label>基准流量</label><input type='number' name='learned_flow' min='0' max='100' step='0.001' required value='");
            Esp32BaseWeb::writeHtmlEscaped(learnedFlow);
            Esp32BaseWeb::sendChunk("'><small>单位：L/min，范围 0～100.000；0 表示未设置。</small></p><p class='field full'><label><input type='checkbox' name='enabled' value='1' "); if (zone.enabled) Esp32BaseWeb::sendChunk("checked");
            Esp32BaseWeb::sendChunk("> 启用这条水路</label><small>未安装的水路保持关闭，正常使用页面不会显示。</small></p></div><div class='actions'><button type='button' class='secondary' onclick='this.closest(\"dialog\").close()'>取消</button><input type='submit' value='保存'></div></form>");
            Esp32BaseWeb::sendChunk("</dialog>");
        }
    }
    endPage();
}

